Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/dma.h
/* -------- DMA_BDEVCTRL : (DMA Offset: 0x0C) (R/W 16) CURRENT BUFFER DESCRIPTOR EVENT CONTROL -------- */
#define DMA_BDEVCTRL_RESETVALUE               _UINT16_(0x00)                                       /*  (DMA_BDEVCTRL) CURRENT BUFFER DESCRIPTOR EVENT CONTROL  Reset Value */

#define DMA_BDEVCTRL_EVAUXACT_Pos             _UINT16_(0)                                          /* (DMA_BDEVCTRL) Channel Auxiliary Event Input Action Position */
#define DMA_BDEVCTRL_EVAUXACT_Msk             (_UINT16_(0x3) << DMA_BDEVCTRL_EVAUXACT_Pos)         /* (DMA_BDEVCTRL) Channel Auxiliary Event Input Action Mask */
#define DMA_BDEVCTRL_EVAUXACT(value)          (DMA_BDEVCTRL_EVAUXACT_Msk & (_UINT16_(value) << DMA_BDEVCTRL_EVAUXACT_Pos)) /* Assigment of value for EVAUXACT in the DMA_BDEVCTRL register */
#define   DMA_BDEVCTRL_EVAUXACT_ABORT_BLK_XFER_Val _UINT16_(0x0)                                        /* (DMA_BDEVCTRL) Event Aborts Bock Transfer  */
#define   DMA_BDEVCTRL_EVAUXACT_INCR_CHN_PRI_Val _UINT16_(0x1)                                        /* (DMA_BDEVCTRL) Event Increments Channel Priority  */
#define   DMA_BDEVCTRL_EVAUXACT_COND_TRIG_Val _UINT16_(0x2)                                        /* (DMA_BDEVCTRL) Event acts as a Conditional Trigger  */
#define DMA_BDEVCTRL_EVAUXACT_ABORT_BLK_XFER  (DMA_BDEVCTRL_EVAUXACT_ABORT_BLK_XFER_Val << DMA_BDEVCTRL_EVAUXACT_Pos) /* (DMA_BDEVCTRL) Event Aborts Bock Transfer Position  */
#define DMA_BDEVCTRL_EVAUXACT_INCR_CHN_PRI    (DMA_BDEVCTRL_EVAUXACT_INCR_CHN_PRI_Val << DMA_BDEVCTRL_EVAUXACT_Pos) /* (DMA_BDEVCTRL) Event Increments Channel Priority Position  */
#define DMA_BDEVCTRL_EVAUXACT_COND_TRIG       (DMA_BDEVCTRL_EVAUXACT_COND_TRIG_Val << DMA_BDEVCTRL_EVAUXACT_Pos) /* (DMA_BDEVCTRL) Event acts as a Conditional Trigger Position  */
#define DMA_BDEVCTRL_EVOMODE_Pos              _UINT16_(2)                                          /* (DMA_BDEVCTRL) Channel Event Output Mode Position */
#define DMA_BDEVCTRL_EVOMODE_Msk              (_UINT16_(0x3) << DMA_BDEVCTRL_EVOMODE_Pos)          /* (DMA_BDEVCTRL) Channel Event Output Mode Mask */
#define DMA_BDEVCTRL_EVOMODE(value)           (DMA_BDEVCTRL_EVOMODE_Msk & (_UINT16_(value) << DMA_BDEVCTRL_EVOMODE_Pos)) /* Assigment of value for EVOMODE in the DMA_BDEVCTRL register */
#define   DMA_BDEVCTRL_EVOMODE_STRB_ON_BLCK_XFER_Val _UINT16_(0x0)                                        /* (DMA_BDEVCTRL) Generate a channel event strobe for 1 clock cycle at the end of block transfer  */
#define   DMA_BDEVCTRL_EVOMODE_STRB_ON_CELL_XFER_Val _UINT16_(0x1)                                        /* (DMA_BDEVCTRL) Generate a channel event strobe for 1 clock cycle at the end of cell transfer  */
#define   DMA_BDEVCTRL_EVOMODE_STRB_START_EVT_TRG_TO_CELL_XFER_READ_Val _UINT16_(0x2)                                        /* (DMA_BDEVCTRL) Generate a channel event strobe from start event trigger to the completion of cell transfer read  */
#define   DMA_BDEVCTRL_EVOMODE_STRB_START_EVT_TRG_TO_CELL_XFER_WRITE_Val _UINT16_(0x3)                                        /* (DMA_BDEVCTRL) Generate a channel event strobe from start event trigger to the completion of cell transfer write  */
#define DMA_BDEVCTRL_EVOMODE_STRB_ON_BLCK_XFER (DMA_BDEVCTRL_EVOMODE_STRB_ON_BLCK_XFER_Val << DMA_BDEVCTRL_EVOMODE_Pos) /* (DMA_BDEVCTRL) Generate a channel event strobe for 1 clock cycle at the end of block transfer Position  */
#define DMA_BDEVCTRL_EVOMODE_STRB_ON_CELL_XFER (DMA_BDEVCTRL_EVOMODE_STRB_ON_CELL_XFER_Val << DMA_BDEVCTRL_EVOMODE_Pos) /* (DMA_BDEVCTRL) Generate a channel event strobe for 1 clock cycle at the end of cell transfer Position  */
#define DMA_BDEVCTRL_EVOMODE_STRB_START_EVT_TRG_TO_CELL_XFER_READ (DMA_BDEVCTRL_EVOMODE_STRB_START_EVT_TRG_TO_CELL_XFER_READ_Val << DMA_BDEVCTRL_EVOMODE_Pos) /* (DMA_BDEVCTRL) Generate a channel event strobe from start event trigger to the completion of cell transfer read Position  */
#define DMA_BDEVCTRL_EVOMODE_STRB_START_EVT_TRG_TO_CELL_XFER_WRITE (DMA_BDEVCTRL_EVOMODE_STRB_START_EVT_TRG_TO_CELL_XFER_WRITE_Val << DMA_BDEVCTRL_EVOMODE_Pos) /* (DMA_BDEVCTRL) Generate a channel event strobe from start event trigger to the completion of cell transfer write Position  */
#define DMA_BDEVCTRL_EVAUXIE_Pos              _UINT16_(5)                                          /* (DMA_BDEVCTRL) Channel Auxiliary Event Enable (0: disable; 1: enable) Position */
#define DMA_BDEVCTRL_EVAUXIE_Msk              (_UINT16_(0x1) << DMA_BDEVCTRL_EVAUXIE_Pos)          /* (DMA_BDEVCTRL) Channel Auxiliary Event Enable (0: disable; 1: enable) Mask */
#define DMA_BDEVCTRL_EVAUXIE(value)           (DMA_BDEVCTRL_EVAUXIE_Msk & (_UINT16_(value) << DMA_BDEVCTRL_EVAUXIE_Pos)) /* Assigment of value for EVAUXIE in the DMA_BDEVCTRL register */
#define DMA_BDEVCTRL_EVSTRIE_Pos              _UINT16_(6)                                          /* (DMA_BDEVCTRL) Channel Start Event Input Enable (0: disable; 1:enable) Position */
#define DMA_BDEVCTRL_EVSTRIE_Msk              (_UINT16_(0x1) << DMA_BDEVCTRL_EVSTRIE_Pos)          /* (DMA_BDEVCTRL) Channel Start Event Input Enable (0: disable; 1:enable) Mask */
#define DMA_BDEVCTRL_EVSTRIE(value)           (DMA_BDEVCTRL_EVSTRIE_Msk & (_UINT16_(value) << DMA_BDEVCTRL_EVSTRIE_Pos)) /* Assigment of value for EVSTRIE in the DMA_BDEVCTRL register */
#define DMA_BDEVCTRL_EVOE_Pos                 _UINT16_(7)                                          /* (DMA_BDEVCTRL) Channel Event Output Enable (0: disable; 1: enable) Position */
#define DMA_BDEVCTRL_EVOE_Msk                 (_UINT16_(0x1) << DMA_BDEVCTRL_EVOE_Pos)             /* (DMA_BDEVCTRL) Channel Event Output Enable (0: disable; 1: enable) Mask */
#define DMA_BDEVCTRL_EVOE(value)              (DMA_BDEVCTRL_EVOE_Msk & (_UINT16_(value) << DMA_BDEVCTRL_EVOE_Pos)) /* Assigment of value for EVOE in the DMA_BDEVCTRL register */
#define DMA_BDEVCTRL_Msk                      _UINT16_(0x00EF)                                     /* (DMA_BDEVCTRL) Register Mask  */


/* -------- DMA_BDCTRLCRC : (DMA Offset: 0x0E) (R/W 16) CURRENT BUFFER DESCRIPTOR CRC CONTROL -------- */
#define DMA_BDCTRLCRC_RESETVALUE              _UINT16_(0x00)                                       /*  (DMA_BDCTRLCRC) CURRENT BUFFER DESCRIPTOR CRC CONTROL  Reset Value */

#define DMA_BDCTRLCRC_CRCMD_Pos               _UINT16_(0)                                          /* (DMA_BDCTRLCRC) CRC/Checksum Mode Position */
#define DMA_BDCTRLCRC_CRCMD_Msk               (_UINT16_(0x7) << DMA_BDCTRLCRC_CRCMD_Pos)           /* (DMA_BDCTRLCRC) CRC/Checksum Mode Mask */
#define DMA_BDCTRLCRC_CRCMD(value)            (DMA_BDCTRLCRC_CRCMD_Msk & (_UINT16_(value) << DMA_BDCTRLCRC_CRCMD_Pos)) /* Assigment of value for CRCMD in the DMA_BDCTRLCRC register */
#define   DMA_BDCTRLCRC_CRCMD_CRC_16_Val      _UINT16_(0x0)                                        /* (DMA_BDCTRLCRC) Normal (0x8005) CRC-16/CRC-16-IBM/CRC-16-ANSI  */
#define   DMA_BDCTRLCRC_CRCMD_CRC_16_CCITT_Val _UINT16_(0x1)                                        /* (DMA_BDCTRLCRC) Normal (0x1021) CRC-16-CCITT  */
#define   DMA_BDCTRLCRC_CRCMD_16_BIT_CRCPOLYA_Val _UINT16_(0x2)                                        /* (DMA_BDCTRLCRC) CRC-16 based on polynomial provided in CRCPOLYA (POLYA[15:0]) register  */
#define   DMA_BDCTRLCRC_CRCMD_16_BIT_CRCPOLYB_Val _UINT16_(0x3)                                        /* (DMA_BDCTRLCRC) CRC-16 based on polynomial provided in CRCPOLYB (POLYB[15:0]) register  */
#define   DMA_BDCTRLCRC_CRCMD_CRC_32_Val      _UINT16_(0x4)                                        /* (DMA_BDCTRLCRC) Normal (0x04C11DB7) CRC-32  */
#define   DMA_BDCTRLCRC_CRCMD_32_BIT_CRCPOLYA_Val _UINT16_(0x5)                                        /* (DMA_BDCTRLCRC) CRC-32 based on polynomial provided in CRCPOLYA register  */
#define   DMA_BDCTRLCRC_CRCMD_32_BIT_CRCPOLYB_Val _UINT16_(0x6)                                        /* (DMA_BDCTRLCRC) CRC-32 based on polynomial provided in CRCPOLYB register  */
#define   DMA_BDCTRLCRC_CRCMD_IP_HDR_CHECKSUM_Val _UINT16_(0x7)                                        /* (DMA_BDCTRLCRC) Calculate IP header checksum  */
#define DMA_BDCTRLCRC_CRCMD_CRC_16            (DMA_BDCTRLCRC_CRCMD_CRC_16_Val << DMA_BDCTRLCRC_CRCMD_Pos) /* (DMA_BDCTRLCRC) Normal (0x8005) CRC-16/CRC-16-IBM/CRC-16-ANSI Position  */
#define DMA_BDCTRLCRC_CRCMD_CRC_16_CCITT      (DMA_BDCTRLCRC_CRCMD_CRC_16_CCITT_Val << DMA_BDCTRLCRC_CRCMD_Pos) /* (DMA_BDCTRLCRC) Normal (0x1021) CRC-16-CCITT Position  */
#define DMA_BDCTRLCRC_CRCMD_16_BIT_CRCPOLYA   (DMA_BDCTRLCRC_CRCMD_16_BIT_CRCPOLYA_Val << DMA_BDCTRLCRC_CRCMD_Pos) /* (DMA_BDCTRLCRC) CRC-16 based on polynomial provided in CRCPOLYA (POLYA[15:0]) register Position  */
#define DMA_BDCTRLCRC_CRCMD_16_BIT_CRCPOLYB   (DMA_BDCTRLCRC_CRCMD_16_BIT_CRCPOLYB_Val << DMA_BDCTRLCRC_CRCMD_Pos) /* (DMA_BDCTRLCRC) CRC-16 based on polynomial provided in CRCPOLYB (POLYB[15:0]) register Position  */
#define DMA_BDCTRLCRC_CRCMD_CRC_32            (DMA_BDCTRLCRC_CRCMD_CRC_32_Val << DMA_BDCTRLCRC_CRCMD_Pos) /* (DMA_BDCTRLCRC) Normal (0x04C11DB7) CRC-32 Position  */
#define DMA_BDCTRLCRC_CRCMD_32_BIT_CRCPOLYA   (DMA_BDCTRLCRC_CRCMD_32_BIT_CRCPOLYA_Val << DMA_BDCTRLCRC_CRCMD_Pos) /* (DMA_BDCTRLCRC) CRC-32 based on polynomial provided in CRCPOLYA register Position  */
#define DMA_BDCTRLCRC_CRCMD_32_BIT_CRCPOLYB   (DMA_BDCTRLCRC_CRCMD_32_BIT_CRCPOLYB_Val << DMA_BDCTRLCRC_CRCMD_Pos) /* (DMA_BDCTRLCRC) CRC-32 based on polynomial provided in CRCPOLYB register Position  */
#define DMA_BDCTRLCRC_CRCMD_IP_HDR_CHECKSUM   (DMA_BDCTRLCRC_CRCMD_IP_HDR_CHECKSUM_Val << DMA_BDCTRLCRC_CRCMD_Pos) /* (DMA_BDCTRLCRC) Calculate IP header checksum Position  */
#define DMA_BDCTRLCRC_CRCAPP_Pos              _UINT16_(3)                                          /* (DMA_BDCTRLCRC) CRC Append Mode Position */
#define DMA_BDCTRLCRC_CRCAPP_Msk              (_UINT16_(0x1) << DMA_BDCTRLCRC_CRCAPP_Pos)          /* (DMA_BDCTRLCRC) CRC Append Mode Mask */
#define DMA_BDCTRLCRC_CRCAPP(value)           (DMA_BDCTRLCRC_CRCAPP_Msk & (_UINT16_(value) << DMA_BDCTRLCRC_CRCAPP_Pos)) /* Assigment of value for CRCAPP in the DMA_BDCTRLCRC register */
#define DMA_BDCTRLCRC_CRCXOR_Pos              _UINT16_(5)                                          /* (DMA_BDCTRLCRC) CRC XOR Mode Position */
#define DMA_BDCTRLCRC_CRCXOR_Msk              (_UINT16_(0x1) << DMA_BDCTRLCRC_CRCXOR_Pos)          /* (DMA_BDCTRLCRC) CRC XOR Mode Mask */
#define DMA_BDCTRLCRC_CRCXOR(value)           (DMA_BDCTRLCRC_CRCXOR_Msk & (_UINT16_(value) << DMA_BDCTRLCRC_CRCXOR_Pos)) /* Assigment of value for CRCXOR in the DMA_BDCTRLCRC register */
#define DMA_BDCTRLCRC_CRCROUT_Pos             _UINT16_(6)                                          /* (DMA_BDCTRLCRC) CRC Reflected Output Mode Position */
#define DMA_BDCTRLCRC_CRCROUT_Msk             (_UINT16_(0x1) << DMA_BDCTRLCRC_CRCROUT_Pos)         /* (DMA_BDCTRLCRC) CRC Reflected Output Mode Mask */
#define DMA_BDCTRLCRC_CRCROUT(value)          (DMA_BDCTRLCRC_CRCROUT_Msk & (_UINT16_(value) << DMA_BDCTRLCRC_CRCROUT_Pos)) /* Assigment of value for CRCROUT in the DMA_BDCTRLCRC register */
#define DMA_BDCTRLCRC_CRCRIN_Pos              _UINT16_(7)                                          /* (DMA_BDCTRLCRC) CRC Reflect Input Selection Position */
#define DMA_BDCTRLCRC_CRCRIN_Msk              (_UINT16_(0x1) << DMA_BDCTRLCRC_CRCRIN_Pos)          /* (DMA_BDCTRLCRC) CRC Reflect Input Selection Mask */
#define DMA_BDCTRLCRC_CRCRIN(value)           (DMA_BDCTRLCRC_CRCRIN_Msk & (_UINT16_(value) << DMA_BDCTRLCRC_CRCRIN_Pos)) /* Assigment of value for CRCRIN in the DMA_BDCTRLCRC register */
#define DMA_BDCTRLCRC_Msk                     _UINT16_(0x00EF)                                     /* (DMA_BDCTRLCRC) Register Mask  */


